SPedt_!/src/Documents/СинхронизацияГрафиковРаботы/СинхронизацияГрафиковРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СинхронизацияГрафиковРаботы</name>
  <attributes>
    <name>НачалоЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикИзменился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботы</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочийДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Праздники</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДобавитьНеРабочиеДни</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>с</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>по</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/Documents/СинхронизацияГрафиковРаботы/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПросмотрПолученногоXML(Команда)
	хмл_incomes = Элементы.Протокол.ТекущиеДанные.ПолученныеДанные;
	СтоСП_Клиент.Показать_XML(хмл_incomes);
КонецПроцедуры


&НаСервере
Процедура ГруппаСтраницыПриСменеСтраницыНаСервере()
	Если Элементы.Страницы.ТекущаяСтраница	= Элементы.Страницы.ПодчиненныеЭлементы.ГруппаПротокол Тогда
		парамДок				= Протокол.Параметры.Элементы.Найти("Документ");
		парамДок.Значение		= Объект.Ссылка;
		парамДок.Использование	= Истина;
	Конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ГруппаСтраницыПриСменеСтраницыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьРежимРаботыНаСервере()
	СтоСПОбмен_ГрафикРаботы.ЗагрузитьРежимРаботы(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРежимРаботы(Команда)
	ЗаписатьДокумент();
	ЗагрузитьРежимРаботыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПраздникиНаСервере()                   
	Объект.Праздники.Очистить();
	СтоСПОбмен_ГрафикРаботы.ЗагрузитьПраздничныеДни(Объект,НачалоГода(Объект.Дата));
	СтоСПОбмен_ГрафикРаботы.ЗагрузитьПраздничныеДни(Объект,КонецГода(Объект.Дата)+1);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПраздники(Команда)
	ЗаписатьДокумент();
	ЗагрузитьПраздникиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Объект.НачалоЗагрузки) Тогда
		Объект.НачалоЗагрузки	= НачалоМесяца(ТекущаяДата());
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьДокумент()
	Если не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда 
		СП_РаботаСДокументами_Клиент.ЗаписатьДокумент(ЭтаФорма);	
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ДобавитьНеРабочиеДниНаСервере()
	СтоСПОбмен_ГрафикРаботы.ДобавитьНеРабочиеДни(Объект.ДобавитьНеРабочиеДни.Выгрузить(),Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНеРабочиеДни(Команда)
	ЗаписатьДокумент();
	ДобавитьНеРабочиеДниНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКалендариНаСервере()
	ГрафикиРаботыПунктаВыдачи.ЗаполнитьКалендари(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКалендари(Команда)
	ЗаполнитьКалендариНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьСинхранизациюВКалендаряхНаСервере()
	ГрафикиРаботыПунктаВыдачи.ПерезаполнитьКлендариДаннымиСинхронизации(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьСинхранизациюВКалендарях(Команда)
	ОтразитьСинхранизациюВКалендаряхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьПраздникиВСправочникНаСервере()
	ГрафикиРаботыПунктаВыдачи.ОтразитьПраздникиВСправочнике(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьПраздникиВСправочник(Команда)
	ОтразитьПраздникиВСправочникНаСервере();
КонецПроцедуры
